src/Documents/ПоступлениеНаРасчетныйСчет/ПоступлениеНаРасчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРасчетныйСчет</name>
  <basedOn>Document.Реализация</basedOn>
  <registerRecords>AccumulationRegister.Покупатели</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.Банк</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.Статьи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВДоходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Покупатели/Покупатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Покупатели</name>
  <resources>
    <name>Сумма</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Банк/Банк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Банк</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.Статьи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыОперацийПоступлениеДенежныхСредств/ВидыОперацийПоступлениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеДенежныхСредств</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПокупателя</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступление</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеНаСчетМиша</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПоступлениеНаРасчетныйСчет/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВалютаРуб = Справочники.Валюты.НайтиПоКоду("643");
	
	// ------ Взаиморасчеты --	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя  Тогда
	
		Движения.Покупатели.Записывать = Истина;
		Движение = Движения.Покупатели.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период			= Дата;
		Движение.Контрагент		= Контрагент;
		Движение.Сумма			= Сумма;
		
	КонецЕсли; 
	
	// ------ банк --	
	
	Движения.Банк.Записывать = Истина;
	Движение = Движения.Банк.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	
	Движение.Период	= Дата;
	Движение.Валюта	= Валюта;
	Движение.Счет	= Счет;
	
	Движение.Сумма	= Сумма;
	
	// ------ Доходы --
	
	Если НЕ НеВключатьВДоходы Тогда
	
		Движения.Доходы.Записывать = Истина;
		Движение = Движения.Доходы.Добавить();
		
		Движение.Период	= Дата;
		Движение.Статья	= Статья;
		Движение.Сумма	= Сумма;
	
	КонецЕсли; 
	
КонецПроцедуры
